In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
suv_data = pd.read_csv('./Assets/suv_data.csv')

suv_data

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [168]:
Required_Data = suv_data.drop(["User ID", "Gender"], axis=1)

In [169]:
Required_Data

     Age  EstimatedSalary  Purchased
0     19            19000          0
1     35            20000          0
2     26            43000          0
3     27            57000          0
4     19            76000          0
..   ...              ...        ...
395   46            41000          1
396   51            23000          1
397   50            20000          1
398   36            33000          0
399   49            36000          1

[400 rows x 3 columns]

In [72]:
X = suv_data[["Age", "EstimatedSalary"]]
Y = suv_data["Purchased"]

In [9]:
X.head()

   Age  EstimatedSalary
0   19            19000
1   35            20000
2   26            43000
3   27            57000
4   19            76000

In [73]:
Y.head()

0    0
1    0
2    0
3    0
4    0
Name: Purchased, dtype: int64

In [19]:
Xc = X.copy()

In [20]:
Xc["Age"] = Xc["Age"] / max(Xc["Age"])
Xc["EstimatedSalary"] = Xc["EstimatedSalary"] / max(Xc["EstimatedSalary"])

Xc

          Age  EstimatedSalary
0    0.316667         0.126667
1    0.583333         0.133333
2    0.433333         0.286667
3    0.450000         0.380000
4    0.316667         0.506667
..        ...              ...
395  0.766667         0.273333
396  0.850000         0.153333
397  0.833333         0.133333
398  0.600000         0.220000
399  0.816667         0.240000

[400 rows x 2 columns]

In [138]:
def calculateDist(x, y, X_Param, k):
    X_Param["Age"] = X_Param["Age"] / max(X_Param["Age"])
    X_Param["EstimatedSalary"] = X_Param["EstimatedSalary"] / max(X_Param["EstimatedSalary"])
    x = x / max(X["Age"])
    y = y / max(X["EstimatedSalary"])
    X_Param = X_Param.assign(Distance=lambda C: np.sqrt((C["Age"] - x)**2 + (C["EstimatedSalary"] - y)**2))
    return X_Param.sort_values(by="Distance").head(n=k)

In [133]:
calculateDist(19,19000, Xc)

          Age  EstimatedSalary  Distance
0    0.316667         0.126667  0.000000
104  0.316667         0.140000  0.013333
72   0.333333         0.153333  0.031447
32   0.350000         0.106667  0.038873
139  0.316667         0.166667  0.040000

In [211]:
calculateDist(32,150000, Required_Data,4)

          Age  EstimatedSalary  Purchased  Distance
7    0.533333         1.000000          1  0.000000
103  0.550000         0.993333          1  0.017951
168  0.483333         0.986667          1  0.051747
230  0.583333         0.980000          1  0.053852

In [214]:
rez = Y.loc[calculateDist(19,19000, Xc, 5).index]

In [224]:
def classify(rez):
    yes = 0
    no = 0
    for i in rez.values:
        if i == 1:
            yes += 1
        elif i == 0:
            no += 1
    # print(no, yes)
    return np.argmax([no, yes])

In [220]:
purchased = ["yes", "no"]

print(purchased[np.argmax(c)])

yes

In [106]:
Y.head()

0    0
1    0
2    0
3    0
4    0
Name: Purchased, dtype: int64

In [107]:
Y.tail()

395    1
396    1
397    1
398    0
399    1
Name: Purchased, dtype: int64

In [113]:
Required_Data.sample(n=10)

     Age  EstimatedSalary  Purchased
179   31            34000          0
204   58           101000          1
18    46            28000          1
233   49            86000          1
217   40            78000          0
365   59            29000          1
286   37            62000          0
250   44            39000          0
288   41            79000          0
297   43           112000          1

In [192]:
Required_Data

          Age  EstimatedSalary  Purchased
0    0.316667         0.126667          0
1    0.583333         0.133333          0
2    0.433333         0.286667          0
3    0.450000         0.380000          0
4    0.316667         0.506667          0
..        ...              ...        ...
395  0.766667         0.273333          1
396  0.850000         0.153333          1
397  0.833333         0.133333          1
398  0.600000         0.220000          0
399  0.816667         0.240000          1

[400 rows x 3 columns]

In [205]:
calculateDist(20, 100000, Required_Data,5)

          Age  EstimatedSalary  Purchased  Distance
170  0.350000         0.586667          0  0.081718
12   0.333333         0.573333          0  0.093333
165  0.300000         0.573333          0  0.099107
145  0.400000         0.593333          0  0.099107
140  0.316667         0.566667          0  0.101379

0

In [199]:
classify(calculateDist(19, 19000, Required_Data,1)["Purchased"])

0

In [225]:
classify(calculateDist(32, 150000, Required_Data,5)["Purchased"])

1

In [227]:
correct = 0
incorrect = 0
for _, j in Required_Data.loc[:10].iterrows():
    print(j[0], j[1])
    # print(classify(calculateDist(j[0], j[1], Required_Data,5)["Purchased"]), j[2])
    # if classify(calculateDist(j[0], j[1], Required_Data,1)["Purchased"]) == j[2]:
    #     correct += 1
    # else:
    #     incorrect += 1

# print(correct / (correct + incorrect)*100, incorrect)
    # print(j[0], j[1], j[2])

0.31666666666666665 0.12666666666666668
0.5833333333333334 0.13333333333333333
0.43333333333333335 0.2866666666666667
0.45 0.38
0.31666666666666665 0.5066666666666667
0.45 0.38666666666666666
0.45 0.56
0.5333333333333333 1.0
0.4166666666666667 0.22
0.5833333333333334 0.43333333333333335
0.43333333333333335 0.5333333333333333

In [207]:
Required_Data.loc[:10]

         Age  EstimatedSalary  Purchased
0   0.316667         0.126667          0
1   0.583333         0.133333          0
2   0.433333         0.286667          0
3   0.450000         0.380000          0
4   0.316667         0.506667          0
5   0.450000         0.386667          0
6   0.450000         0.560000          0
7   0.533333         1.000000          1
8   0.416667         0.220000          0
9   0.583333         0.433333          0
10  0.433333         0.533333          0

In [209]:
for i in range(10):

Age                    32
EstimatedSalary    150000
Name: 7, dtype: int64